# Taps
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "mongodb/brew"
tap "shivammathur/php"
tap "shivammathur/extensions"
tap "minio/stable"
tap "oven-sh/bun"

# Essential binary
brew "git"
brew "htop"
brew "wget"
brew "coreutils"
brew "starship" # Starship shell prompt
brew "lsd"

# Fonts
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"

# Essential applications
brew "mackup" # Mac backups
cask "appcleaner" # App uninstaller
cask "warp" # Terminal
cask "raycast" # Spotlight alternative
cask "alt-tab" # Switch windows using Alt + Tab keys
cask "stats" # CPU, GPU, Network stats in menubar
cask "shottr" # Screenshot annotation tool

# Development applications
brew "php"
brew "volta"
brew "oven-sh/bun/bun"

# Php extensions
brew "shivammathur/extensions/memcached@8.2"
brew "shivammathur/extensions/xdebug@8.2"
brew "shivammathur/extensions/mongodb@8.2"
brew "shivammathur/extensions/swoole@8.2"

# Databases
brew "mysql"
brew "redis"
brew "postgresql@15"
brew "mongodb/brew/mongodb-community"
brew "meilisearch"

# testing tools
brew "mailpit" # Local email testing tool
brew "minio" # Local s3 testing tool


# Apps
cask "herd" # Laravel and PHP development environment manager
cask "tableplus" # Database management tool
cask "orbstack" # Docker desktop alternative
cask "postman" # Api testing tool

cask "iina" # Video player
